[Killed] BlockStatement
src/lib/calculator.js:1:35
-module.exports.sum = (num1,num2)=>{
-    const int1 = parseInt(num1,10)
-    const int2 = parseInt(num2,10)
-    
-    if(Number.isNaN(int1) || Number.isNaN(int2)){
-        throw new Error("string de erro")        
-    }
-    return +int1 + +int2
-}
+module.exports.sum = (num1,num2)=>{}
killedBy: should sum 2 and 2 and the result must be 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ConditionalExpression
src/lib/calculator.js:5:8
     const int1 = parseInt(num1,10)
     const int2 = parseInt(num2,10)
     
-    if(Number.isNaN(int1) || Number.isNaN(int2)){
+    if(true){
         throw new Error("string de erro")        
     }
killedBy: should sum 2 and 2 and the result must be 4
statusReason: Error: string de erro

[Killed] UnaryOperator
src/lib/calculator.js:8:20
     if(Number.isNaN(int1) || Number.isNaN(int2)){
         throw new Error("string de erro")        
     }
-    return +int1 + +int2
+    return +int1 + -int2
 }
killedBy: should sum 2 and 2 and the result must be 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] UnaryOperator
src/lib/calculator.js:8:12
     if(Number.isNaN(int1) || Number.isNaN(int2)){
         throw new Error("string de erro")        
     }
-    return +int1 + +int2
+    return -int1 + +int2
 }
killedBy: should sum 2 and 2 and the result must be 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0
