[Killed] BlockStatement
src/lib/calculator.js:1:38
-module.exports.sum = (num1, num2) => {
-  const int1 = parseInt(num1, 10);
-  const int2 = parseInt(num2, 10);
-
-  if (Number.isNaN(int1) || Number.isNaN(int2)) {
-    throw new Error();
-  }
-  return +int1 + +int2;
-};
+module.exports.sum = (num1, num2) => {};
 
killedBy: should sum 2 and 2 and the result must be 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] LogicalOperator
src/lib/calculator.js:5:7
   const int1 = parseInt(num1, 10);
   const int2 = parseInt(num2, 10);
 
-  if (Number.isNaN(int1) || Number.isNaN(int2)) {
+  if (Number.isNaN(int1) && Number.isNaN(int2)) {
     throw new Error();
   }
killedBy: should throw an error if what is provided to the method
statusReason: Error: expect(received).toThrowError()

Received function did not throw

[Killed] ConditionalExpression
src/lib/calculator.js:5:7
   const int1 = parseInt(num1, 10);
   const int2 = parseInt(num2, 10);
 
-  if (Number.isNaN(int1) || Number.isNaN(int2)) {
+  if (false) {
     throw new Error();
   }
killedBy: should throw an error if what is provided to the method
statusReason: Error: expect(received).toThrowError()

Received function did not throw

[Killed] UnaryOperator
src/lib/calculator.js:8:18
   if (Number.isNaN(int1) || Number.isNaN(int2)) {
     throw new Error();
   }
-  return +int1 + +int2;
+  return +int1 + -int2;
 };
 
killedBy: should sum 2 and 2 and the result must be 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ArithmeticOperator
src/lib/calculator.js:8:10
   if (Number.isNaN(int1) || Number.isNaN(int2)) {
     throw new Error();
   }
-  return +int1 + +int2;
+  return +int1 - +int2;
 };
 
killedBy: should sum 2 and 2 and the result must be 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0
