[Killed] BlockStatement
src/lib/queryString.js:1:44
-const keyValueToString = ([key, value]) => {
-  if (typeof value === 'object' && !Array.isArray(value)) {
-    throw new Error();
-  }
-  return `${key}=${value}`;
-};
+const keyValueToString = ([key, value]) => {};
 
 module.exports.queryString = obj =>
killedBy: Object to query string should create a valid query string when an object is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "name=Raul&profession=Tester"
Received: "&"

[Killed] LogicalOperator
src/lib/queryString.js:2:7
 const keyValueToString = ([key, value]) => {
-  if (typeof value === 'object' && !Array.isArray(value)) {
+  if (typeof value === 'object' || !Array.isArray(value)) {
     throw new Error();
   }
killedBy: Object to query string should create a valid query string when an object is provided
statusReason: Error:

[Killed] ConditionalExpression
src/lib/queryString.js:2:7
 const keyValueToString = ([key, value]) => {
-  if (typeof value === 'object' && !Array.isArray(value)) {
+  if (false) {
     throw new Error();
   }
killedBy: Object to query string should throw an error whe an object is passed as value
statusReason: Error: expect(received).toThrowError()

Received function did not throw

[Killed] ArrowFunction
src/lib/queryString.js:8:30
   return `${key}=${value}`;
 };
 
-module.exports.queryString = obj =>
-  Object.entries(obj).map(keyValueToString).join('&');
+module.exports.queryString = () => undefined;
 
killedBy: Object to query string should create a valid query string when an object is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "name=Raul&profession=Tester"
Received: undefined

[Killed] StringLiteral
src/lib/queryString.js:9:50
 };
 
 module.exports.queryString = obj =>
-  Object.entries(obj).map(keyValueToString).join('&');
+  Object.entries(obj).map(keyValueToString).join("");
 
killedBy: Object to query string should create a valid query string when an object is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "name=Raul&profession=Tester"
Received: "name=Raulprofession=Tester"
